Revit 2026 API

# CombinableElementArrayIterator Constructor

---

For Internal Use Only.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public CombinableElementArrayIterator()
```
```vb
Public Sub New
```
```cpp
public:
CombinableElementArrayIterator()
```
```fsharp
new : unit -> CombinableElementArrayIterator
```

This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.

#### Reference

CombinableElementArrayIterator Class

Autodesk.Revit.DB Namespace